quanhengwen/STM32F1xWorkSpace19/Driver/Components/SCR/BQ26100.C
#include "BQ26100.H"	

#include "stdlib.h"

#include "STM32_GPIO.H"
#include "STM32_SYSTICK.H"

#include 	"CRC.H"

#define	SDQ_Port		GPIOA
#define	SDQ_Pin			GPIO_Pin_3

#define	SDQ_SetOut		GPIO_Configuration_OPP50(SDQ_Port,	SDQ_Pin)			//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度50MHz----V20170605
#define	SDQ_SetIn			GPIO_RegConfiguration_IPD(SDQ_Port,		SDQ_Pin)			//将GPIO相应管脚配置为下拉输入模式----V20170605

#define	SDQ_H					SDQ_Port->BSRR	= SDQ_Pin			//CPLD_WR	=	1;
#define	SDQ_L					SDQ_Port->BRR		= SDQ_Pin			//CPLD_WR	=	0;

#define	SDQ_Read			SDQ_Port->IDR	& SDQ_Pin			//CPLD_WR	=	0;


#define bq26100_Family_Code 0x09		//默认09

unsigned short bq26100_reg_addr=0x0000;				//寄存器地址
 
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void api_bq26100_configuration(void)
{
	GPIO_Configuration_OPP50	(SDQ_Port,	SDQ_Pin);			//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度50MHz----V20170605
}
/*******************************************************************************
*函数名			:	api_read_id
*功能描述		:	读48字节器件电子标签
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
sdq_result api_bq26100_read_id(unsigned char* pbuffer)
{
	unsigned char i = 0;
	unsigned char Family_Code	=	0;
	sdq_result	result = sdq_error;
	//------------启动总线
	result	=	bq26100_rest();	//复位Dallas,返回结果
	if(sdq_error	==	result)
		return result;
	//------------写入命令
	sdq_write_byte(sdq_rom_readID);
	//------------确认器件
	Family_Code	=	sdq_read_byte();	
	if(bq26100_Family_Code	!= Family_Code)
		return sdq_error;
	//------------读取48位ID
	for(i=0;i<6;i++)
		pbuffer[i]=sdq_read_byte();
	//------------读一字节CRC
	sdq_read_byte();
	return sdq_success;
}

/*******************************************************************************
*函数名			:	api_read_id
*功能描述		:	读64字节器件电子标签
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
sdq_result api_bq26100_skip_id(void)
{
	unsigned char i = 0;
	unsigned char Family_Code	=	0;
	sdq_result	result = sdq_error;
	//------------启动总线
	result	=	bq26100_rest();	//复位Dallas,返回结果
	if(sdq_error	==	result)
		return result;
	//------------写入命令
	sdq_write_byte(sdq_rom_skipID);
	return sdq_success;
}
/*******************************************************************************
*函数名			:	api_read_id
*功能描述		:	读64字节器件电子标签
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
sdq_result api_bq26100_read_memory(unsigned char* pbuffer)
{
	unsigned short i = 0;
	unsigned char Family_Code	=	0;
	sdq_result	result = sdq_error;
	//------------启动总线
	result	=	api_bq26100_skip_id();
	if(sdq_error	==	result)
		return result;
	sdq_write_byte(sdq_mem_read_memory);
	//------------写入地址
	sdq_write_byte(0x00);
	sdq_write_byte(0x00);
	sdq_write_byte(0x9A);
//	//------------确认器件
	Family_Code	=	sdq_read_byte();	
//	if(bq26100_Family_Code	!= Family_Code)
//		return sdq_error;
//	//------------读取64位ID
	for(i=0;i<0x7F;i++)
	sdq_read_byte();
		pbuffer[i]=sdq_read_byte();
	return sdq_success;
}
/*******************************************************************************
*函数名			:	api_read_id
*功能描述		:	读64字节器件电子标签
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
sdq_result api_bq26100_write_memory(unsigned char* pbuffer)
{
	unsigned short i = 0;
	unsigned char Family_Code	=	0;
	sdq_result	result = sdq_error;
	//------------启动总线
	result	=	api_bq26100_skip_id();
	if(sdq_error	==	result)
		return result;
	sdq_write_byte(sdq_mem_write_memory);
	//------------写入地址
	sdq_write_byte(0x00);
	sdq_write_byte(0x00);
	sdq_write_byte(0x9A);
//	//------------确认器件
	Family_Code	=	sdq_read_byte();	
//	if(bq26100_Family_Code	!= Family_Code)
//		return sdq_error;
//	//------------读取64位ID
	for(i=0;i<0x7F;i++)
	sdq_read_byte();
		pbuffer[i]=sdq_read_byte();
	return sdq_success;
}
/*******************************************************************************
*函数名			:	api_read_id
*功能描述		:	读64字节器件电子标签
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
sdq_result api_bq26100_read_page(unsigned char* pbuffer)
{
	unsigned short i = 0;
	unsigned char read_code	=	0;
	sdq_result	result = sdq_error;
	//------------启动总线
	result	=	api_bq26100_skip_id();
	if(sdq_error	==	result)
		return result;
	sdq_write_byte(sdq_mem_read_page);
	//------------写入地址
	sdq_write_byte(0x00);
	sdq_write_byte(0x00);
	//------------Master RX:
	read_code	=	sdq_read_byte();	
//	//------------读取64位ID
	for(i=0;i<0x7F;i++)
		sdq_read_byte();
		//pbuffer[i]=sdq_read_byte();
	return sdq_success;
}
/*******************************************************************************
*函数名			:	api_read_id
*功能描述		:	读64字节器件电子标签
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
sdq_result api_bq26100_read_status(unsigned char* pbuffer)
{
	unsigned short i = 0;
	unsigned char read_code	=	0;
	sdq_result	result = sdq_error;
	//------------启动总线
	result	=	api_bq26100_skip_id();
	if(sdq_error	==	result)
		return result;
	sdq_write_byte(sdq_mem_read_status);
	//------------写入地址
	sdq_write_byte(0x03);
	sdq_write_byte(0x00);
	//------------Master RX:
	read_code	=	sdq_read_byte();	
//	//------------读取64位ID
	for(i=0;i<0x7F;i++)
		sdq_read_byte();
		//pbuffer[i]=sdq_read_byte();
	return sdq_success;
}
/*******************************************************************************
*函数名			:	api_read_id
*功能描述		:	读64字节器件电子标签
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
sdq_result api_bq26100_write_status(unsigned char* pbuffer)
{
	unsigned short i = 0;
	unsigned char read_code	=	0;
	sdq_result	result = sdq_error;
	//------------启动总线
	result	=	api_bq26100_skip_id();
	if(sdq_error	==	result)
		return result;
	sdq_write_byte(sdq_mem_read_page);
	//------------写入地址
	sdq_write_byte(0x00);
	sdq_write_byte(0x00);
	//------------Master RX:
	read_code	=	sdq_read_byte();	
//	//------------读取64位ID
	for(i=0;i<0x7F;i++)
		sdq_read_byte();
		//pbuffer[i]=sdq_read_byte();
	return sdq_success;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
sdq_result bq26100_rom_fun(sdq_rom_cmd rom_cmd)
{
	sdq_result	result	=	sdq_error;
	if(sdq_rom_readID	==	rom_cmd)
	{
	}
	else if(sdq_rom_matchID	==	rom_cmd)
	{
	}
	else if(sdq_rom_skipID	==	rom_cmd)
	{
	}
	else if(sdq_rom_searchID	==	rom_cmd)
	{
	}
	else
	{
		result	=	sdq_error;
	}
	return result;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
sdq_result bq26100_mem_fun(sdq_mem_cmd mem_cmd)
{
	sdq_result	result	=	sdq_error;
	if(sdq_mem_read_memory	==	mem_cmd)
	{
	}
	else if(sdq_mem_write_memory	==	mem_cmd)
	{
	}
	else if(sdq_mem_read_page	==	mem_cmd)
	{
	}
	else if(sdq_mem_read_digest	==	mem_cmd)
	{
	}
	else if(sdq_mem_write_message	==	mem_cmd)
	{
	}
	else if(sdq_mem_read_status	==	mem_cmd)
	{
	}
	else if(sdq_mem_write_status	==	mem_cmd)
	{
	}
	else if(sdq_mem_read_control	==	mem_cmd)
	{
	}
	else if(sdq_mem_write_control	==	mem_cmd)
	{
	}
	else if(sdq_mem_read_eeprom	==	mem_cmd)
	{
	}
	else if(sdq_mem_write_eeprom	==	mem_cmd)
	{
	}	
	else if(sdq_mem_profile	==	mem_cmd)
	{
	}
	else if(sdq_mem_read_page4	==	mem_cmd)
	{
	}
	else if(sdq_mem_write_page4	==	mem_cmd)
	{
	}
	else
	{
		result	=	sdq_error;
	}
	return result;
}

