quanhengwen/STM32F1xWorkSpace19/Driver/Components/SCR/BQ26100.C
// Global Variables for SHA1
unsigned long Ws[80];					//Global Work schedule variable--计算时需要用到的缓冲区
unsigned long A;	//缓冲区，计算前初始化值为0x67452301
unsigned long B;	//缓冲区，计算前初始化值为0xEFCDAB89
unsigned long C;	//缓冲区，计算前初始化值为0x98BADCFE
unsigned long D;	//缓冲区，计算前初始化值为0x10325476
unsigned long E;	//缓冲区，计算前初始化值为0xC3D2E1F0
unsigned long H[5];	//计算出的消息摘要缓存，消息摘要是一个160位的字符串
unsigned long Random[5];		//The 16 bytes of random message for the bq26100 are contained here
					//for microcontroller to use in SHA1/HMAC
unsigned long Digest_32[5];	//The result of the SHA1/HMAC obtained by the microcontroller is contained here


unsigned long key_key32[4] = {0x00,0x01,0x02,0x03};
const unsigned long key_message[5] = { 0xc82ca3ca ,0x10dec726 ,0x8e070a7c ,0xf0d1fe82 ,0x20aad3b8 };		//The 16 bytes of random message for the bq26100 are contained here
const unsigned long key_digest[5] = { 0x18459979,0xca46a610,0xb18d173e,0x0db5d113 ,0x99951241 };	//The result of the SHA1/HMAC obtained by the microcontroller is contained here

/**********************************************************************/
//*	unsigned long Rotl(unsigned long x, int n)
//*																      
//*	Description : 		This procedure is a rotate left n spaces of	32-bit word x.
//*	Arguments : 		x - word to be rotated n - amount of spaces to rotated to the left
//*	Global Variables:	None
//*	Returns: 			Result of 32-bit word rotated n times
/**********************************************************************/
unsigned long Rotl(unsigned long x, int n)
{
	return (x<<n) |  (x>>(32-n));
}
/**********************************************************************/
//* 	unsigned long W(int t)
//*	Description : 		This procedure determines the work schedule for W(16) through W(79)
//* 	Arguments : 		t - index of work schedule 16 through 79
//*	Global Variables:	Ws[]
//*  Returns: 			Work schedule value with index t
/**********************************************************************/
unsigned long W(int t)
{
	return Rotl(Ws[t-3] ^ Ws[t-8] ^ Ws[t-14] ^ Ws[t-16], 1);
}	

/**********************************************************************/
//*	unsigned long K(int t)
//*																      */
//*	Description : 		This procedure selects one of the K values depending on the index t.
//*	Arguments : 		t - index 
//*	Global Variables:	None
//*	Returns: 			One of the 4 K values
/**********************************************************************/
unsigned long K(int t)
{
	if (t<=19)
		return 0x5a827999;
	else if (t>=20 && t<=39)
		return 0x6ed9eba1;
	else if (t>=40 && t<=59)
		return 0x8f1bbcdc;
	else if (t>=60 && t<=79)
		return 0xca62c1d6;
	else
		return 0;		//Invalid value, not expected
}
	
/*******************************************************************************/
//*	unsigned long f(unsigned long x, unsigned long y, unsigned long z, int t)
//*																               */
//*	Description : 		This procedure selects the ft(b,c,d) function based on SLUA389 and FIPS 180-2 document.
//*	Arguments : 	x - b as seen in document 
//*								y - c as seen in document
//*             	z - d as seed in document
//*              	t - index
//*	Global Variables:	None
//*	Returns: 			Result of ft function
/*******************************************************************************/
unsigned long f(u32 x, u32 y, u32 z, int t)
{
	if (t<=19)
		return (x & y) ^ ((~x) & z);
	else if (t>=20 && t<=39)
		return x ^ y ^ z;
	else if (t>=40 && t<=59)
		return (x & y) ^ (x & z) ^ (y & z);
	else if (t>=60 && t<=79)
		return x ^ y ^ z;
	else
		return 0;       //Invalid value, not expected
}
//-----------------------------------------------------------------------------



/*******************************************************************************
*函数名			:	api_bq26100_step1_Auth
*功能描述		:	本程序按照BQ26100的要求计算SHA1/HMAC
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
* 	void Auth(void)
*														
*	Description : 		This procedure computes the SHA1/HMAC as
*				  		required by the bq26100
* 	Arguments : 		i - times that SHA1 is executing			 
*						t - index 0 through 79
*     					temp - Used to update working variables
*	Global Variables:	Random[], Message[], Key[], Ws[], H[],
*						A, B, C, D, E	
*  Returns: 			Result of 32-bit word rotated n times
*******************************************************************************/
void api_bq26100_step1_Auth(void)
{
	int i;			//Used for doing two times the SHA1 as required by the bq26100
	int t;			//Used for the indexes 0 through 79
	u32 temp;		//Used as the temp variable during the loop in which the working
							//variables A, B, C, D and E are updated
	
	// The 20 bytes of random message that are given to the bq26100 are arranged in 32-bit words
	// so that the microcontroller can compute the SHA1/HMAC
	Random[0] = Message[0x10] + Message[0x11]*0x0100 + Message[0x12]*0x010000 + Message[0x13]*0x01000000;
	Random[1] = Message[0x0C] + Message[0x0D]*0x0100 + Message[0x0E]*0x010000 + Message[0x0F]*0x01000000;
	Random[2] = Message[0x08] + Message[0x09]*0x0100 + Message[0x0A]*0x010000 + Message[0x0B]*0x01000000;
	Random[3] = Message[0x04] + Message[0x05]*0x0100 + Message[0x06]*0x010000 + Message[0x07]*0x01000000;
	Random[4] = Message[0x00] + Message[0x01]*0x0100 + Message[0x02]*0x010000 + Message[0x03]*0x01000000;
	// The SHA1 is computed two times so that it complies with the bq26100 specification
	for (i=0; i<=1; i++)	//转换两次
	{
		//-------------------加载密钥
		// Work Schedule
		// The first four Working schedule variables Ws[0-3], are based on the key that is 
		// implied that the bq26100 contains.
		Ws[0] = Key[0x0C] + Key[0x0D]*0x0100 + Key[0x0E]*0x010000 + Key[0x0F]*0x01000000;
		Ws[1] = Key[0x08] + Key[0x09]*0x0100 + Key[0x0A]*0x010000 + Key[0x0B]*0x01000000;
		Ws[2] = Key[0x04] + Key[0x05]*0x0100 + Key[0x06]*0x010000 + Key[0x07]*0x01000000;
		Ws[3] = Key[0x00] + Key[0x01]*0x0100 + Key[0x02]*0x010000 + Key[0x03]*0x01000000;
		//-------------------第一次转换加载消息，第二将转换加载第一次转换的消息摘要
		// On the first run of the SHA1 the random message is used 		
		if (i==0)
		{
			Ws[4] = Random[0];
			Ws[5] = Random[1];
			Ws[6] = Random[2];
			Ws[7] = Random[3];
			Ws[8] = Random[4];
		}
		// On the second run of the SHA1, H(Kd || M) is used		
		else
		{
			Ws[4] = H[0];
			Ws[5] = H[1];
			Ws[6] = H[2];
			Ws[7] = H[3];
			Ws[8] = H[4];
		}
		//-------------------补位操作:
		//Sha-1算法标准规定，必须对消息摘要进行补位操作，即将输入的数据进行填充，使得数据长度对512求余的结果为448，
		//填充比特位的最高位补一个1，其余的位补0，如果在补位之前已经满足对512取模余数为448，也要进行补位，在其后补一位1即可。总之，补位是至少补一位，最多补512位
		// The Work schedule variables Ws[9-15] remain the same regardless of which run of the SHA1.
		// These values are as required by bq26100.	//以下为按照bq26100规定的数值
		Ws[9]	= 0x80000000;		//输入消息长度对512取模余数结果非448(512-64)
		Ws[10] = 0x00000000;
		Ws[11] = 0x00000000;
		Ws[12] = 0x00000000;
		Ws[13] = 0x00000000;
		//--------------------附加信息长度(64位):表示消息摘要的字节数，
		Ws[14] = 0x00000000;
		Ws[15] = 0x00000120;		//总共长度为0x0120(288=160+128)密钥和消息的长度
		
		//--------------------补充混合数据
		// The Work schedule variables Ws[16-79] are determined by the W(t) function	
		for (t = 16; t <= 79; t++)
			Ws[t]=W(t);
		//--------------------初始化缓存
		//一个160位MD缓冲区用以保存中间和最终散列函数的结果。它可以表示为5个32位的寄存器(H0,H1,H2,H3,H4)。初始化为：
		// Working Variables, always start the same	regardless of which SHA1 run
		A = 0x67452301;
		B = 0xefcdab89;
		C = 0x98badcfe;
		D = 0x10325476;
		E = 0xc3d2e1f0;
		// Hash Values, always start the same regardless of what SHA1 run
		H[0] = A;
		H[1] = B;
		H[2] = C;
		H[3] = D;
		H[4] = E;
		//---------------------循环转换数据
		// Loop to change working variables A, B, C, D and E
		// This is defined by FIPS 180-2 document
		for (t = 0; t <= 79; t++)
		{
				temp = Rotl(A,5) + f(B,C,D,t) + E + K(t) + Ws[t];
				E = D;
				D = C;
				C = Rotl(B,30);
				B = A;
				A = temp;
		}
		//----------------------转换出验证结果:转换再次，第一次结果参当作第二次转换的数据
		// 160-Bit SHA-1 Digest
		H[0] = A + H[0];
		H[1] = B + H[1];
		H[2] = C + H[2];
		H[3] = D + H[3];
		H[4] = E + H[4];
	}//End of for loop
}	//End Auth() function
/*******************************************************************************
*函数名			:	api_bq26100_step2_send_message
*功能描述		:	Send 160-bit Message to bq26100
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
sdq_result api_bq26100_step2_send_message(unsigned char* message,unsigned char len)
{
	unsigned char i = 0;
	unsigned char Value	=	0;
	sdq_result result;
	// Send 160-bit Message to bq26100
	result	=	bq26100_rest();
	if(sdq_error	==	result)
		return sdq_error;
	// Skip ROM Command
	sdq_write_byte(0xCC);
	// Write Message Command
	sdq_write_byte(0x22);	//Write Message Command
	// Write Address
	//bq26100_reg_addr
	sdq_write_byte(bq26100_reg_addr&0xFF);	//Address Low Byte
	sdq_write_byte((bq26100_reg_addr>>8)&0xFF);	//Address High Byte
	// Write first byte of message, Message[0]
	sdq_write_byte(Message[0x00]);	
	Value	=	sdq_read_byte();	//Read CRC of Message Command, Address and Data
	//CRC are not being calculated by the microcontroller, the results given by
	//bq26100 are being ignored
	// Read Data to Verify Write
	Value	=	sdq_read_byte();
	// Write the remaining bytes of the message
	for (i=1; i<=19; i++)
	{
		sdq_write_byte(Message[i]);
		Value	=	sdq_read_byte();		//Read CRC of Message Command, Address and Data
																//CRC are not being calculated by the microcontroller, the results given by
																//bq26100 are being ignored
		Value	=	sdq_read_byte();		// Read Data to Verify Write
	}
	return sdq_success;
}
/*******************************************************************************
*函数名			:	api_bq26100_step3_write_control
*功能描述		:	Write Control to set AUTH bit to initiate Authentication by bq26100
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
sdq_result api_bq26100_step3_write_control(void)
{
	unsigned char Value	=	0;
	sdq_result result;
	// Write Control to set AUTH bit to initiate Authentication by bq26100
	result	=	bq26100_rest();
	if(sdq_error	==	result)
		return sdq_error;
	//Value = TestPresence();
	// Skip ROM Command
	sdq_write_byte(0xCC);
	// Write Control Command
	sdq_write_byte(sdq_mem_write_control);	//Write Control Command
	//bq26100_reg_addr
//	sdq_write_byte(bq26100_reg_addr&0xFF);	//Address Low Byte
//	sdq_write_byte((bq26100_reg_addr>>8)&0xFF);	//Address High Byte
	sdq_write_byte(0x00);	//Address Low Byte
	sdq_write_byte(0x00);	//Address High Byte	
	sdq_write_byte(0x05);			// Write Auth Bit of Control Register
	Value = sdq_read_byte();	//Read CRC of Write Control Command, Address and Data
	// Read Data to Verify Write
	Value = sdq_read_byte();
	
	//sdq_write_byte(0x01);	//Address Low Byte
	//sdq_write_byte(0x00);	//Address High Byte
	sdq_write_byte(0xA1);			// Write Auth Bit of Control Register
	Value = sdq_read_byte();	//Read CRC of Write Control Command, Address and Data	
	Value = sdq_read_byte();	// Read Data to Verify Write
	return sdq_success;
}
/*******************************************************************************
*函数名			:	api_bq26100_step3_write_control
*功能描述		:	Write Control to set AUTH bit to initiate Authentication by bq26100
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
sdq_result api_bq26100_step4_read_control(void)
{
	unsigned char Value	=	0;
	sdq_result result;
	// Write Control to set AUTH bit to initiate Authentication by bq26100
	result	=	bq26100_rest();
	if(sdq_error	==	result)
		return sdq_error;
	//Value = TestPresence();
	// Skip ROM Command
	sdq_write_byte(0xCC);
	// Write Control Command
	sdq_write_byte(sdq_mem_read_control);	//Write Control Command
	//bq26100_reg_addr
//	sdq_write_byte(bq26100_reg_addr&0xFF);	//Address Low Byte
//	sdq_write_byte((bq26100_reg_addr>>8)&0xFF);	//Address High Byte
	sdq_write_byte(0x00);	//Address Low Byte
	sdq_write_byte(0x00);	//Address High Byte	
	Value = sdq_read_byte();	//Read CRC of Write Control Command, Address and Data
	Value = sdq_read_byte();
	sdq_write_byte(0xA1);	
	Value = sdq_read_byte();	//Read CRC of Write Control Command, Address and Data	
	return sdq_success;
}
/*******************************************************************************
*函数名			:	api_bq26100_step5_read_digest
*功能描述		:	Read Digest
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
sdq_result api_bq26100_step5_read_digest(unsigned char* Digest)
{
	unsigned char i = 0;
	unsigned char Value	=	0;
	sdq_result result;
	//Read Digest
	result	=	bq26100_rest();
	if(sdq_error	==	result)
		return sdq_error;	
	//Value = TestPresence();
	// Skip ROM Command
	sdq_write_byte(0xCC);
	// Read Digest Command
	sdq_write_byte(0xDD);	//Read Digest Command
	// Write Address
	//bq26100_reg_addr
	sdq_write_byte(bq26100_reg_addr&0xFF);	//Address Low Byte
	sdq_write_byte((bq26100_reg_addr>>8)&0xFF);	//Address High Byte
	Value = sdq_read_byte();	//Read CRC of Read Digest Command, Address
	// Read Digest
	for (i=0; i<=19; i++)
	{
		Digest[i] = sdq_read_byte();
	}
	// Read CRC of Digest
	Value = sdq_read_byte();

	// The 20 bytes of the digest returned by the bq26100 is arranged in 32-bit words so that it
	// can be compared with the results computed by the microcontroller
	
	Digest_32[4] = Digest[0x00] + Digest[0x01]*0x0100 + Digest[0x02]*0x010000 + Digest[0x03]*0x01000000;
	Digest_32[3] = Digest[0x04] + Digest[0x05]*0x0100 + Digest[0x06]*0x010000 + Digest[0x07]*0x01000000;
	Digest_32[2] = Digest[0x08] + Digest[0x09]*0x0100 + Digest[0x0A]*0x010000 + Digest[0x0B]*0x01000000;
	Digest_32[1] = Digest[0x0C] + Digest[0x0D]*0x0100 + Digest[0x0E]*0x010000 + Digest[0x0F]*0x01000000;
	Digest_32[0] = Digest[0x10] + Digest[0x11]*0x0100 + Digest[0x12]*0x010000 + Digest[0x13]*0x01000000;
	if ((Digest_32[0] == H[0])&&(Digest_32[1] == H[1])&&(Digest_32[2] == H[2])&&(Digest_32[3] == H[3]))
	{
		//------------------------验证通过
	}
	return sdq_success;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void bq26100_set_key(void)
{
	// Select the key to be used here. In this example 0x3601FCFB12B87356C1548630FD3EA0D2 is used.  
	Key[0] = 0xD2;
	Key[1] = 0xA0;
	Key[2] = 0x3E;
	Key[3] = 0xFD;
	Key[4] = 0x30;
	Key[5] = 0x86;
	Key[6] = 0x54;
	Key[7] = 0xC1;
	Key[8] = 0x56;
	Key[9] = 0x73;
	Key[10] = 0xB8;
	Key[11] = 0x12;
	Key[12] = 0xFB;
	Key[13] = 0xFC;
	Key[14] = 0x01;
	Key[15] = 0x36;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void bq26100_set_message(void)
{
	unsigned char i = 0;
	static unsigned char data=0;
	//-----------------------------随机数
	srand(0);
	for (i=0; i<=19; i++)
	{
		Message[i] = rand()%256;		//获取随机数
	}
	//-----------------------------上电启动:验证通过
	Message[0]	=	0xb8;
	Message[1]	=	0xd3;
	Message[2]	=	0xaa;
	Message[3]	=	0x20;
	Message[4]	=	0x82;
	Message[5]	=	0xfe;
	Message[6]	=	0xd1;
	Message[7]	=	0xf0;
	Message[8]	=	0x7c;
	Message[9]	=	0x0a;
	Message[10]	=	0x07;
	Message[11]	=	0x8e;
	Message[12]	=	0x26;
	Message[13]	=	0xc7;
	Message[14]	=	0xde;
	Message[15]	=	0x10;
	Message[16]	=	0xca;
	Message[17]	=	0xa3;
	Message[18]	=	0x2c;
	Message[19]	=	0xc8;
	//-----------------------------测试数据2
	Message[0]	=	0x34;
	Message[1]	=	0xb9;
	Message[2]	=	0x03;
	Message[3]	=	0x4c;
	Message[4]	=	0xf9;
	Message[5]	=	0x9c;
	Message[6]	=	0xcf;
	Message[7]	=	0x8e;
	Message[8]	=	0xe7;
	Message[9]	=	0x43;
	Message[10]	=	0xe9;
	Message[11]	=	0xf2;
	Message[12]	=	0x62;
	Message[13]	=	0x8a;
	Message[14]	=	0xc1;
	Message[15]	=	0x8b;
	Message[16]	=	0x32;
	Message[17]	=	0x92;
	Message[18]	=	0x48;
	Message[19]	=	0x46;
	//-----------------------------测试数据2
//	Message[0]	=	0xda;
//	Message[1]	=	0x31;
//	Message[2]	=	0x55;
//	Message[3]	=	0x86;
//	Message[4]	=	0x0e;
//	Message[5]	=	0x90;
//	Message[6]	=	0xa3;
//	Message[7]	=	0x1f;
//	Message[8]	=	0x88;
//	Message[9]	=	0xd6;
//	Message[10]	=	0xc9;
//	Message[11]	=	0xdc;
//	Message[12]	=	0x41;
//	Message[13]	=	0x6d;
//	Message[14]	=	0xd3;
//	Message[15]	=	0x1c;
//	Message[16]	=	0x4a;
//	Message[17]	=	0xd6;
//	Message[18]	=	0x59;
//	Message[19]	=	0xf6;
	//-----------------------------测试数据2
//	Message[0]	=	0x95;
//	Message[1]	=	0x79;
//	Message[2]	=	0x80;
//	Message[3]	=	0x1c;
//	Message[4]	=	0x75;
//	Message[5]	=	0x80;
//	Message[6]	=	0x94;
//	Message[7]	=	0x58;
//	Message[8]	=	0x41;
//	Message[9]	=	0xb1;
//	Message[10]	=	0x31;
//	Message[11]	=	0x37;
//	Message[12]	=	0x96;
//	Message[13]	=	0x92;
//	Message[14]	=	0x91;
//	Message[15]	=	0xdb;
//	Message[16]	=	0x34;
//	Message[17]	=	0x9d;
//	Message[18]	=	0x1d;
//	Message[19]	=	0x5a;
//-----------------------------测试数据2
	//83 b2 06 2e 21 60 79 00 f3 60 b0 f1 b7 2e 27 bc ff a7 e3 f1
	Message[0]	=	0x83;
	Message[1]	=	0xB2;
	Message[2]	=	0x06;
	Message[3]	=	0x2E;
	Message[4]	=	0x21;
	Message[5]	=	0x60;
	Message[6]	=	0x79;
	Message[7]	=	0x00;
	Message[8]	=	0xF3;
	Message[9]	=	0x60;
	Message[10]	=	0xB0;
	Message[11]	=	0xF1;
	Message[12]	=	0xB7;
	Message[13]	=	0x2E;
	Message[14]	=	0x27;
	Message[15]	=	0xBC;
	Message[16]	=	0xFF;
	Message[17]	=	0xFF;
	Message[18]	=	0xA7;
	Message[19]	=	0xE3;
//-----------------------------逻辑分析仪007:验证通过
	Message[0]	=	0xFD;
	Message[1]	=	0xAB;
	Message[2]	=	0x14;
	Message[3]	=	0xB6;
	Message[4]	=	0xCE;
	Message[5]	=	0x0A;
	Message[6]	=	0x28;
	Message[7]	=	0x41;
	Message[8]	=	0x2F;
	Message[9]	=	0x08;
	Message[10]	=	0x6D;
	Message[11]	=	0xD4;
	Message[12]	=	0xDB;
	Message[13]	=	0x62;
	Message[14]	=	0x89;
	Message[15]	=	0xB0;
	Message[16]	=	0x77;
	Message[17]	=	0x30;
	Message[18]	=	0x59;
	Message[19]	=	0x5D;
	//-----------------------------逻辑分析仪001:验证通过
	//0xEC 0x8D 0x31 0x3B 0xCF 0xAD 0x8A 0x2E 0xAA 0xF9 0xAA 0x26 0xC1 0xFF  0xF1 0xD2 0x95 0x91 0xAA 0xEA 
	Message[0]	=	0xEC;
	Message[1]	=	0x8D;
	Message[2]	=	0x31;
	Message[3]	=	0x3B;
	Message[4]	=	0xCF;
	Message[5]	=	0xAD;
	Message[6]	=	0x8A;
	Message[7]	=	0x2E;
	Message[8]	=	0xAA;
	Message[9]	=	0xF9;
	Message[10]	=	0xAA;
	Message[11]	=	0x26;
	Message[12]	=	0xC1;
	Message[13]	=	0xFF;
	Message[14]	=	0xF1;
	Message[15]	=	0xD2;
	Message[16]	=	0x95;
	Message[17]	=	0x91;
	Message[18]	=	0xAA;
	Message[19]	=	0xEA;
	//-----------------------------逻辑分析仪002:
	//0x4D 0x9B 0x16 0x28 0x66 0x43 0xB9 0x85 0x9C 0x46 0xE2 0xB7 0x1A 0x91 0x7F 0xEA 0xE0 0x1C 0x21 0xBD
	Message[0]	=	0x4D;
	Message[1]	=	0x9B;
	Message[2]	=	0x16;
	Message[3]	=	0x28;
	Message[4]	=	0x66;
	Message[5]	=	0x43;
	Message[6]	=	0xB9;
	Message[7]	=	0x85;
	Message[8]	=	0x9C;
	Message[9]	=	0x46;
	Message[10]	=	0xE2;
	Message[11]	=	0xB7;
	Message[12]	=	0x1A;
	Message[13]	=	0x91;
	Message[14]	=	0x7F;
	Message[15]	=	0xEA;
	Message[16]	=	0xE0;
	Message[17]	=	0x1C;
	Message[18]	=	0x21;
	Message[19]	=	0xBD;
	
